In [2]:
import pandas as pd

In [5]:
counties1 = {"Name":["Nairobi","Mombasa","Nyeri"],
            "HQ":["CityHall","Bamburi","Kagumo"],
            "Size":[20000,2400,3000]}

In [34]:
d1 = pd.DataFrame(counties1)

In [35]:
d1

      Name        HQ   Size
0  Nairobi  CityHall  20000
1  Mombasa   Bamburi   2400
2    Nyeri    Kagumo   3000

In [36]:
d1[d1["Size"]>2500]

      Name        HQ   Size
0  Nairobi  CityHall  20000
2    Nyeri    Kagumo   3000

In [37]:
d1[(d1["Size"]>2500) & (d1["Size"]<5000)]

    Name      HQ  Size
2  Nyeri  Kagumo  3000

Loc: Uses labels and not index
You have to set thr label you want to use as the index

In [38]:
d1.loc[2]

Name     Nyeri
HQ      Kagumo
Size      3000
Name: 2, dtype: object

In [39]:
d1.loc[1,"Name"]

'Mombasa'

In [40]:
d1.loc[0:,["Name","Size"]]

      Name   Size
0  Nairobi  20000
1  Mombasa   2400
2    Nyeri   3000

In [41]:
d1.loc[0:2,["Name","Size"]]

      Name   Size
0  Nairobi  20000
1  Mombasa   2400
2    Nyeri   3000

In [42]:
d1.index

RangeIndex(start=0, stop=3, step=1)

In [43]:
d1.set_index("Name")

               HQ   Size
Name
Nairobi  CityHall  20000
Mombasa   Bamburi   2400
Nyeri      Kagumo   3000

Data Cleaning & Manipulation

In [47]:
titanic = pd.read_csv("/Users/atienojacinta/PYDATA /Pandas/tested.csv")

In [48]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [49]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [50]:
titanic.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
413,False,False,False,False,False,True,False,False,False,False,True,False
414,False,False,False,False,False,False,False,False,False,False,False,False
415,False,False,False,False,False,False,False,False,False,False,True,False
416,False,False,False,False,False,True,False,False,False,False,True,False
417,False,False,False,False,False,True,False,False,False,False,True,False

In [52]:
titanic.notna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,False,True
2,True,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,True,False,True
4,True,True,True,True,True,True,True,True,True,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...
413,True,True,True,True,True,False,True,True,True,True,False,True
414,True,True,True,True,True,True,True,True,True,True,True,True
415,True,True,True,True,True,True,True,True,True,True,False,True
416,True,True,True,True,True,False,True,True,True,True,False,True
417,True,True,True,True,True,False,True,True,True,True,False,True

In [54]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [56]:
titanic.notna().sum()

PassengerId    418
Survived       418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

### Handling missing data

#### 1. Drop the missing data

In [57]:
titanic1 = titanic.dropna()

In [60]:
titanic.shape

(418, 12)

In [58]:
titanic1.shape

(87, 12)

In [61]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [63]:
titanic1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
26,918,1,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
28,920,0,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S

#### 2. Fill the missing data with avalue

In [67]:
titanic2 = titanic.fillna(0)

In [68]:
titanic.shape

(418, 12)

In [69]:
titanic2.shape

(418, 12)

In [71]:
titanic2.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [72]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [73]:
titanic2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,0,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,0,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,0,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,0,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,0,S

In [75]:
titanic["Cabin"].values

array([nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, 'B45',
       nan, 'E31', nan, nan, nan, nan, nan, nan, nan, nan, nan,
       'B57 B59 B63 B66', nan, 'B36', nan, 'A21', nan, nan, nan, nan, nan,
       'C78', nan, nan, nan, nan, nan, nan, 'D34', nan, nan, 'D19', nan,
       'A9', nan, 'D15', nan, 'C31', nan, nan, 'C23 C25 C27', nan, nan,
       nan, 'F G63', nan, 'B61', nan, nan, nan, nan, 'B57 B59 B63 B66',
       nan, nan, nan, 'C53', 'C23 C25 C27', nan, nan, nan, 'D43', 'C130',
       'C132', nan, 'C101', nan, nan, nan, 'C55 C57', nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, 'B71', nan, nan, nan, 'C46', nan,
       nan, nan, 'C116', nan, nan, nan, nan, nan, nan, nan, nan, 'F', nan,
       nan, 'A29', nan, 'C55 C57', nan, nan, 'G6', 'C6', nan, nan, nan,
       'C28', nan, nan, nan, nan, nan, nan, nan, nan, 'C51', nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, 'B57 B59 B63 B66', nan,
       nan, nan, 'E46', nan, nan, nan, 'C54', nan, nan, nan, nan, nan,
       'C97', nan, 'D22', nan, nan, nan, nan, nan, nan, nan, 'B10', nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, 'C116', 'F4', 'E45',
       nan, 'E52', 'D30', nan, 'B58 B60', nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, 'E34', nan, nan, nan, nan, nan, 'C62 C64',
       nan, nan, nan, nan, nan, 'A11', nan, nan, nan, nan, nan, nan,
       'B11', nan, nan, 'C80', nan, nan, nan, 'F33', nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, 'C85', nan, 'D37', nan, nan,
       'C86', nan, nan, 'E34', nan, nan, 'D21', nan, nan, nan, nan, nan,
       nan, 'C89', nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, 'C6', nan, 'C89', nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, 'B45', 'F E46',
       nan, nan, nan, nan, 'A34', nan, nan, nan, nan, nan, nan, nan, 'D',
       nan, nan, nan, 'B26', 'C22 C26', nan, 'B69', nan, nan, nan, nan,
       nan, 'C32', nan, 'B78', nan, nan, nan, nan, 'F E57', 'F2', nan,
       nan, nan, 'F4', nan, nan, nan, nan, 'A18', nan, nan, nan, 'C106',
       nan, nan, nan, nan, nan, nan, nan, 'B51 B53 B55', nan, nan, nan,
       nan, nan, nan, 'D10 D12', nan, nan, nan, nan, 'E60', 'C101', nan,
       nan, nan, nan, nan, nan, nan, 'E50', nan, nan, nan, nan, nan, nan,
       'E39 E41', 'B52 B54 B56', nan, 'A34', nan, nan, nan, 'C39', nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, 'B24', 'D28',
       nan, nan, nan, 'C31', nan, 'B41', nan, nan, 'C7', nan, nan, nan,
       'D40', 'D38', nan, 'C80', nan, nan, nan, 'C78', nan, nan, 'C105',
       nan, nan, nan], dtype=object)

In [76]:
titanic2["Cabin"].values

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'B45', 0, 'E31', 0, 0, 0, 0, 0,
       0, 0, 0, 0, 'B57 B59 B63 B66', 0, 'B36', 0, 'A21', 0, 0, 0, 0, 0,
       'C78', 0, 0, 0, 0, 0, 0, 'D34', 0, 0, 'D19', 0, 'A9', 0, 'D15', 0,
       'C31', 0, 0, 'C23 C25 C27', 0, 0, 0, 'F G63', 0, 'B61', 0, 0, 0, 0,
       'B57 B59 B63 B66', 0, 0, 0, 'C53', 'C23 C25 C27', 0, 0, 0, 'D43',
       'C130', 'C132', 0, 'C101', 0, 0, 0, 'C55 C57', 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 'B71', 0, 0, 0, 'C46', 0, 0, 0, 'C116', 0, 0, 0, 0, 0, 0,
       0, 0, 'F', 0, 0, 'A29', 0, 'C55 C57', 0, 0, 'G6', 'C6', 0, 0, 0,
       'C28', 0, 0, 0, 0, 0, 0, 0, 0, 'C51', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       'B57 B59 B63 B66', 0, 0, 0, 'E46', 0, 0, 0, 'C54', 0, 0, 0, 0, 0,
       'C97', 0, 'D22', 0, 0, 0, 0, 0, 0, 0, 'B10', 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 'C116', 'F4', 'E45', 0, 'E52', 'D30', 0, 'B58 B60', 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 'E34', 0, 0, 0, 0, 0, 'C62 C64', 0, 0,
       0, 0, 0, 'A11', 0, 0, 0, 0, 0, 0, 'B11', 0, 0, 'C80', 0, 0, 0,
       'F33', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C85', 0, 'D37', 0, 0,
       'C86', 0, 0, 'E34', 0, 0, 'D21', 0, 0, 0, 0, 0, 0, 'C89', 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C6', 0, 'C89', 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'B45', 'F E46', 0, 0, 0, 0, 'A34',
       0, 0, 0, 0, 0, 0, 0, 'D', 0, 0, 0, 'B26', 'C22 C26', 0, 'B69', 0,
       0, 0, 0, 0, 'C32', 0, 'B78', 0, 0, 0, 0, 'F E57', 'F2', 0, 0, 0,
       'F4', 0, 0, 0, 0, 'A18', 0, 0, 0, 'C106', 0, 0, 0, 0, 0, 0, 0,
       'B51 B53 B55', 0, 0, 0, 0, 0, 0, 'D10 D12', 0, 0, 0, 0, 'E60',
       'C101', 0, 0, 0, 0, 0, 0, 0, 'E50', 0, 0, 0, 0, 0, 0, 'E39 E41',
       'B52 B54 B56', 0, 'A34', 0, 0, 0, 'C39', 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 'B24', 'D28', 0, 0, 0, 'C31', 0, 'B41', 0, 0, 'C7', 0, 0, 0,
       'D40', 'D38', 0, 'C80', 0, 0, 0, 'C78', 0, 0, 'C105', 0, 0, 0],
      dtype=object)

In [78]:
titanic["Cabin"].unique()

array([nan, 'B45', 'E31', 'B57 B59 B63 B66', 'B36', 'A21', 'C78', 'D34',
       'D19', 'A9', 'D15', 'C31', 'C23 C25 C27', 'F G63', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C101', 'C55 C57', 'B71', 'C46', 'C116',
       'F', 'A29', 'G6', 'C6', 'C28', 'C51', 'E46', 'C54', 'C97', 'D22',
       'B10', 'F4', 'E45', 'E52', 'D30', 'B58 B60', 'E34', 'C62 C64',
       'A11', 'B11', 'C80', 'F33', 'C85', 'D37', 'C86', 'D21', 'C89',
       'F E46', 'A34', 'D', 'B26', 'C22 C26', 'B69', 'C32', 'B78',
       'F E57', 'F2', 'A18', 'C106', 'B51 B53 B55', 'D10 D12', 'E60',
       'E50', 'E39 E41', 'B52 B54 B56', 'C39', 'B24', 'D28', 'B41', 'C7',
       'D40', 'D38', 'C105'], dtype=object)

In [79]:
titanic2["Cabin"].unique()

array([0, 'B45', 'E31', 'B57 B59 B63 B66', 'B36', 'A21', 'C78', 'D34',
       'D19', 'A9', 'D15', 'C31', 'C23 C25 C27', 'F G63', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C101', 'C55 C57', 'B71', 'C46', 'C116',
       'F', 'A29', 'G6', 'C6', 'C28', 'C51', 'E46', 'C54', 'C97', 'D22',
       'B10', 'F4', 'E45', 'E52', 'D30', 'B58 B60', 'E34', 'C62 C64',
       'A11', 'B11', 'C80', 'F33', 'C85', 'D37', 'C86', 'D21', 'C89',
       'F E46', 'A34', 'D', 'B26', 'C22 C26', 'B69', 'C32', 'B78',
       'F E57', 'F2', 'A18', 'C106', 'B51 B53 B55', 'D10 D12', 'E60',
       'E50', 'E39 E41', 'B52 B54 B56', 'C39', 'B24', 'D28', 'B41', 'C7',
       'D40', 'D38', 'C105'], dtype=object)

In [82]:
titanic["Cabin"].nunique()

76

In [83]:
titanic2["Cabin"].nunique()

77

In [85]:
titanic['Cabin'].value_counts()

Cabin
B57 B59 B63 B66    3
B45                2
C89                2
C55 C57            2
A34                2
                  ..
E52                1
D30                1
E31                1
C62 C64            1
C105               1
Name: count, Length: 76, dtype: int64

In [86]:
titanic2['Cabin'].value_counts()

Cabin
0                  327
B57 B59 B63 B66      3
C89                  2
C116                 2
C80                  2
                  ...
E45                  1
E52                  1
B58 B60              1
C62 C64              1
C105                 1
Name: count, Length: 77, dtype: int64

In [93]:
titanic['Cabin'].fillna("Missing Cabin number",inplace=True)

In [94]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Missing Cabin number,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,Missing Cabin number,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Missing Cabin number,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,Missing Cabin number,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,Missing Cabin number,S

In [97]:
mean_age = titanic['Age'].mean()
print(mean_age)

30.272590361445783

In [99]:
titanic['Age'].fillna(mean_age,inplace=True)

/var/folders/b7/64294z_j16d0t1nszkgct6_c0000gn/T/ipykernel_61961/3343186649.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['Age'].fillna(mean_age,inplace=True)

In [100]:
titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Cabin          0
Embarked       0
dtype: int64

In [104]:
mode_fare = titanic['Fare'].mode()
print(mode_fare)

0    7.75
Name: Fare, dtype: float64

In [105]:
titanic['Fare'].fillna(mode_fare,inplace=True)

/var/folders/b7/64294z_j16d0t1nszkgct6_c0000gn/T/ipykernel_61961/1430746986.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['Fare'].fillna(mode_fare,inplace=True)

### Delete entire column

In [109]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [111]:
titanic.drop("Cabin",axis=1,inplace=True)

In [112]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [113]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [114]:
titanic.drop(0,axis=0,inplace=True)

In [115]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,S

### More Operations

#### Rename a column

In [116]:
titanic.rename(columns={"Sex":"Gender"},inplace=True)

In [117]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

#### Set label as index

In [118]:
titanic.set_index("Name",inplace=True)

In [119]:
titanic.head()

,PassengerId,Survived,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Embarked
Name,,,,,,,,,,
"Wilkes, Mrs. James (Ellen Needs)",893,1,3,female,47.0,1,0,363272,7.0000,S
"Myles, Mr. Thomas Francis",894,0,2,male,62.0,0,0,240276,9.6875,Q
"Wirz, Mr. Albert",895,0,3,male,27.0,0,0,315154,8.6625,S
"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,1,3,female,22.0,1,1,3101298,12.2875,S
"Svensson, Mr. Johan Cervin",897,0,3,male,14.0,0,0,7538,9.2250,S

In [120]:
titanic.reset_index(inplace=True)

In [121]:
titanic.head()

,Name,PassengerId,Survived,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Embarked
0,"Wilkes, Mrs. James (Ellen Needs)",893,1,3,female,47.0,1,0,363272,7.0000,S
1,"Myles, Mr. Thomas Francis",894,0,2,male,62.0,0,0,240276,9.6875,Q
2,"Wirz, Mr. Albert",895,0,3,male,27.0,0,0,315154,8.6625,S
3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,1,3,female,22.0,1,1,3101298,12.2875,S
4,"Svensson, Mr. Johan Cervin",897,0,3,male,14.0,0,0,7538,9.2250,S